###### Globals ######

## LOOKUP
[juniper_vendor_info_lookup]
filename = juniper_vendor_info.csv

[juniper_nsm_action_lookup]
filename = juniper_nsm_actions.csv

[juniper_nsm_severity_lookup]
filename = juniper_nsm_idp_severities.csv

[juniper_transport_protocols_lookup]
filename = juniper_transport_protocols.csv

[netscreen_firewall_ids_info_lookup]
filename = netscreen_firewall_ids_info.csv

###### Juniper Firewall (Netscreen Firewall) ######

## TRANSFORMS
[force_host_for_netscreen_firewall]
DEST_KEY = MetaData:Host
REGEX = \s+([^\s]+)\:\s+NetScreen\s+device_id\=
FORMAT = host::$1

[force_sourcetype_for_netscreen_firewall]
DEST_KEY = MetaData:Sourcetype
REGEX = \s+NetScreen\s+device_id\=
FORMAT = sourcetype::netscreen:firewall

[force_sourcetype_for_juniper_idp]
DEST_KEY = MetaData:Sourcetype
REGEX = syslog@juniper.net
FORMAT = sourcetype::juniper:idp

## LOOKUP
[netscreen_firewall_action_lookup]
filename = netscreen_firewall_actions.csv

## REPORT
[action_as_vendor_action]
REGEX = action\=([^\s]+)
FORMAT = vendor_action::$1

[dest_translated_for_netscreen_firewall]
REGEX = dst-xlated\s+ip\s*=\s*(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\s+port\s*=\s*(\d+)
FORMAT = dest_translated_ip::$1 dest_translated_port::$2

[src_translated_for_netscreen_firewall]
REGEX = src-xlated\s+ip\s*=\s*(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\s+port\s*=\s*(\d+)
FORMAT = src_translated_ip::$1 src_translated_port::$2

[zone_for_netscreen_firewall]
REGEX = src\s+zone\=(\w+)\s+dst\s+zone\=(\w+)\s+
FORMAT = src_zone::$1 dest_zone::$2

## Netscreen Authentication Extractions

[local_admin_auth_for_netscreen_firewall]
REGEX = \s+([^\s]+)\:\s+(NetScreen).*Local\s+admin\s+authentication\s+(failed|successful)\s+for\s+login\s+name\s+([^\s:]+)
FORMAT = dest::$1 vendor_app::$2 vendor_action::$3 netscreen_user::$4

[login_refused_for_netscreen_firewall]
REGEX = \s+([^\s]+)\:\s+(NetScreen).*Login\s+attempt\s+by\s+admin\s+(\S+)\s+from\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\s+is\s+(refused)
FORMAT = dest::$1 vendor_app::$2 netscreen_user::$3 src_ip::$4 vendor_action::$5

[password_auth_for_netscreen_firewall]
REGEX = \s+([^\s]+)\:\s+(NetScreen).*Password\s+authentication\s+(failed|successful)\s+for\s+admin\s+user\s+\'([^']+)\'\s+at\s+host\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})
FORMAT = dest::$1 vendor_app::$2 vendor_action::$3 netscreen_user::$4 src_ip::$5

## Netscreen Network Change Extractions
[change_src_dest_for_netscreen_firewall]
REGEX = system\-notification\-00018\:.*from\s+host\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\s+to\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\:
FORMAT = src_ip::$1 dest_ip::$2

## Modify firewall messages for ScreenOS 6.0.0 Rev2 and later
[firewall_change_for_netscreen_firewall]
REGEX = system\-notification\-00018\:\s(.*\swas\s(\w+).*)\sby\s([^\s]*)\s
FORMAT = command::$1 vendor_action::$2 netscreen_user::$3

[policy_id_1_for_netscreen_firewall]
REGEX = system\-notification\-00018\:.*policy\s*ID\s*(\d+)\s+
FORMAT = policy_id::$1

[policy_id_2_for_netscreen_firewall]
REGEX = system\-notification\-00018\:.*Policy\s*\((\d+),
FORMAT = policy_id::$1

[translation_log_for_netscreen_firewall]
REGEX = \s+([^\s]+)\:\s+(NetScreen) device_id\=([^\s]+)\s+.*system\-information.*\:\s+IP\s+address\s+(\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})\s+.*assigned\s+to\s+(\w+)\.
FORMAT = dest::$1 vendor_app::$2 device_id::$3 ip::$4 mac::$5

[user_for_netscreen_firewall_restart]
REGEX = system\-information\-\w+\:.*System\s+halt\-reboot\s+by\s+\'([^\']+)\'
FORMAT = netscreen_user::$1

[login_failed_for_netscreen_firewall]
REGEX = \s+([^\s]+)\:\s+(NetScreen).*Login\s+attempt\s+to\s+system\s+by\s+admin\s+(\S+)\s+via\s+\S+\s+from\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}):(\d+)\s+has\s+(failed)
FORMAT = dest::$1 vendor_app::$2 netscreen_user::$3 src_ip::$4 src_port::$5 vendor_action::$6

## Alert messages for ScreenOS 6.3.0 Rev5, Published: 2014-12-17
[alert_first_part_for_netscreen_firewall]
REGEX = \s+(NetScreen)\s+.*system\-alert\-(\w+):\s+(.*)
FORMAT = vendor_app::$1 alert_id::$2 body::$3

[alert_rest_part_for_netscreen_firewall]
REGEX = system\-alert\-\w+:\s+\w[^!]+!\s+From\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\:?(\d+)?\s+to\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\:?(\d+)?,\s+proto\s+(\w+)\s+\(zone\s+(\w+),?\s+int\s+([^\s)]+)\)\.\s+Occurred\s+(\d+)\s+times
FORMAT = src_ip::$1 src_port::$2 dest_ip::$3 dest_port::$4 protocol::$5 zone::$6 interface_name::$7 frequency::$8

###### Juniper IDP ######

## TRANSFORMS
[force_sourcetype_for_juniper_nsm_idp]
DEST_KEY = MetaData:Sourcetype
REGEX = predefined\,\s+
FORMAT = sourcetype::juniper:nsm:idp

## LOOKUP
[juniper_idp_severity_lookup]
filename = juniper_idp_severities.csv
case_sensitive_match = false

[juniper_idp_action_lookup]
filename = juniper_idp_actions.csv
case_sensitive_match = false

## REPORT
[auto_kv_for_juniper_nsm_idp]
DELIMS = ","
FIELDS = day_id,event_id,end_time,start_time,dvc_nt_domain,dvc_nt_domain_version,dvc,dvc_ip,category,signature,src_zone,indbound_interface,src_ip,src_port,src_translated_ip,src_translated_port,dest_zone,outbound_interface,dest_ip,dest_port,dest_translated_ip,dest_translated_port,transport,rule_domain,rule_domain_ver,policy,rule_base,rule,nsm_unknown,nsm_action,juniper_severity,signature,details,user,vendor_app,url,duration,bytes_in,bytes_out,bytes,packets_in,packets_out,packets_total,repeat_count,has_packet_data,var_data,appli_service


###### Juniper NSM ######

## TRANSFORMS
[force_sourcetype_for_juniper_nsm]
DEST_KEY = MetaData:Sourcetype
REGEX = traffic\,\s+traffic\s+log
FORMAT = sourcetype::juniper:nsm

## REPORT
[auto_kv_for_juniper_nsm]
DELIMS = ","
FIELDS = day_id,event_id,end_time,start_time,dvc_nt_domain,dvc_nt_domain_version,dvc,dvc_ip,category,sub_category,src_zone,inbound_interface,src_ip,src_port,src_translated_ip,src_translated_port,dest_zone,outbound_interface,dest_ip,dest_port,dest_translated_ip,dest_translated_port,transport,rule_domain,rule_domain_ver,policy,rule_base,rule,nsm_unknown,nsm_action,severity,signature,details,user,vendor_app,url,duration,bytes_in,bytes_out,bytes,packets_in,packets_out,packets_total,repeat_count,has_packet_data,var_data,appli_service


###### Juniper SSLVPN ######

## TRANSFORMS
[force_sourcetype_for_juniper_sslvpn]
DEST_KEY = MetaData:Sourcetype
REGEX = (?:Juniper|)\:\s+\d+\-\d+\-\d+\s+\d+\:\d+\:\d+\s+\-\s+\S+\s+\-\s+\[
FORMAT = sourcetype::juniper:sslvpn

## REPORT
[dest_ip_for_juniper_sslvpn]
REGEX = with\s+IP(?:\w+|)(?:\s+address|)\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})
FORMAT = dest_ip::$1

[dest_nt_host_for_juniper_sslvpn]
REGEX = \,\s+hostname\s+(\S+)
FORMAT = dest_nt_host::$1

[src_ip_for_juniper_sslvpn]
REGEX = \s+\-\s+\[(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})
FORMAT = src_ip::$1

[user_for_juniper_sslvpn]
REGEX = \s+\-\s+\[\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\]\s+([^(]+)
FORMAT = juniper_sslvpn_user::$1

## Juniper SSL VPN Authentication
[juniper_sslvpn_action]
REGEX = [Ll]ogin\s+(succeeded|failed)
FORMAT = juniper_sslvpn_action::$1

[juniper_sslvpn_action_lookup]
filename = juniper_sslvpn_action.csv

[juniper_sslvpn_message]
REGEX = \] - (.*)$
FORMAT = juniper_sslvpn_message::"$1"

[juniper_sslvpn_session_action]
REGEX = User with IP \d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3} (connected) with
FORMAT = juniper_sslvpn_action::$1

[juniper_sslvpn_session_start_end_action]
REGEX = Network\s+Connect:\s+Session\s+(started|ended)\s+for 
FORMAT = juniper_sslvpn_action::$1

[juniper_sslvpn_dest_for_authentication]
REGEX = Login.*using\s+auth\s+server\s+([^\(]+)\(
FORMAT = auth_dest::$1

[juniper_sslvpn_auth_success_action]
REGEX = Authentication (successful).*,\s*Target:\s+(\S*),.*,\s*Server\s+Realm:\s*(\w*)
FORMAT = juniper_sslvpn_action::$1  auth_dest::$2 dest_nt_domain::$3

[juniper_sslvpn_auth_fail_action]
REGEX = authentication (failed)
FORMAT = juniper_sslvpn_action::$1

[juniper_sslvpn_add_connection]
REGEX = Connected\s+to\s+(\S+)\s+port\s+(\d+)
FORMAT = auth_dest::$1 dest_port::$2

[juniper_sslvpn_session_terminate]
REGEX = Session\s+for\s+user\s+(\S+)\s+on\s+host\s+\S+\s+has\s+been\s+(terminated)
FORMAT = juniper_sslvpn_user::$1 juniper_sslvpn_action::$2

[juniper_sslvpn_close_connection]
REGEX = (Closed)\s+connection\s+to\s+(\S+)(?:\s+port\s+(\d+)|)\s+after\s+(\d+)\s+seconds,\s*with\s*(\d+)\s*bytes\s+read(?:\s+\(in\s+\d+\s+chunks\)|)\s+and\s+(\d+)\s+bytes\s+written
FORMAT = juniper_sslvpn_action::$1 auth_dest::$2 dest_port::$3 duration::$4 bytes_in::$5 bytes_out::$6

[juniper_sslvpn_sending]
REGEX = (Sending)\s+\S+(?:\s+\[[^\]]+\]|)\s+SNMP\s+trap\s+to\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})\:(\d+)
FORMAT = juniper_sslvpn_action::$1 auth_dest::$2 dest_port::$3

[juniper_sslvpn_transport]
REGEX = with\s+(\w+)\s+transport\s+mode
FORMAT = transport::$1

[juniper_sslvpn_src_address]
REGEX = (?:[Ll]ogin|[Aa]uthentication).*from\s+(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})
FORMAT = first_src::$1
###### Juniper Restarts ######

## LOOKUP
[netscreen_change_lookup]
filename = netscreen_changes.csv

## REPORT
[juniper_restart_field]
REGEX = device_id=([\w\-]+).*System\shalt-(reboot)\sby\s'\w+'
FORMAT = dest::$1 vendor_action::$2

###### Juniper JunOS IDP ######

[force_sourcetype_for_junos_idp]
DEST_KEY = MetaData:Sourcetype
REGEX = \s+RT_IDP:\s+
FORMAT = sourcetype::juniper:junos:idp

## REPORT
[vendor_category_for_junos_idp]
REGEX = ,\s*(\w+)\s*Attack log
FORMAT = vendor_category::$1

## LOOKUP
[junos_idp_severity_lookup]
filename = juniper_junos_idp_severities.csv

[junos_idp_category_lookup]
filename = juniper_junos_idp_categories.csv

[message_type_for_junos_idp]
REGEX = ,\s*(\w+)\s+Attack\s+log
FORMAT = message_type::$1

## Aug  9 10:20:00 hq-ifw-02-01.corp.local RT_IDP:
[dvc_for_junos_idp]
REGEX = \d{2}:\d{2}:\d{2}\s+([\-\.\w]+)\s+RT_IDP
FORMAT = dvc::$1

[protocol_service_app_for_junos_idp]
REGEX = for\s+(\w+)\s+protocol\s+and\s+service\s+(\w+)\s+application\s+(\S+)\s+by
FORMAT = protocol::$1 service::$2 vendor_app::$3

[rule_policy_for_junos_idp]
REGEX = by\s+rule\s+(\w+)\s+of\s+rulebase\s+(\w+)\s+in\s+policy\s+(\w+)\.
FORMAT = rule::$1 rulebase_name::$2 policy_name::$3

## Attack log <10.80.15.146/57131->63.215.202.49/80> for
[src_dest_address_port_for_junos_idp]
REGEX = Attack\s+log\s+<([^/|^:]+)[/|:]([^-]+)->([^/|^:]+)[/|:]([^>]+)>\s+for
FORMAT = src_ip::$1 src_port::$2 dest_ip::$3 dest_port::$4

## [NAT] <nat-source-address:nat-source-port->nat-destination-address:nat-destination-port>,
[nat_src_dest_address_port_for_junos_idp]
REGEX = NAT\s+<([^/|^:]+)[/|:]([^-]+)->([^/|^:]+)[/|:]([^>]+)>,
FORMAT = src_translated_ip::$1 src_translated_port::$2 dest_translated_ip::$3 dest_translated_port::$4

## [intf]:source-zone-name:source-interface-name->destination-zone-name:destination-interface-name,
## intf:ENTERPRISE:ae0.470->INTERNET:ae0.530,
## intf:ls-product-design-untrust:ge-0/0/0.0->ls-product-design-trust:ge-0/0/1.0,
[src_dest_interface_for_junos_idp]
REGEX = intf:([^:]+):([^>]+)->([^:]+):([^,]+),
FORMAT = inbound_zone::$1 inbound_interface::$2 outbound_zone::$3 outbound_interface::$4

## packet-log-id: 0 and
[packet_log_id_for_junos_idp]
REGEX = packet-log-id:\s+(\w+)\s+and
FORMAT = packet_log_id::$1

## [and misc-message] message
[misc_message_for_junos_idp]
REGEX = misc-message\s+(\w+)
FORMAT = misc_message::$1

###### Juniper JunOS FW ######

[force_sourcetype_for_junos_firewall]
DEST_KEY = MetaData:Sourcetype
REGEX = \s+RT_FLOW:|\s+RT_IDS:
FORMAT = sourcetype::juniper:junos:firewall

[message_tag_for_junos_fw]
REGEX = RT_FLOW:\s+([^:]+):
FORMAT = message_tag::$1

[dvc_for_junos_fw]
REGEX = \s+([\.\w\-]+)\s+RT_FLOW
FORMAT = dvc::$1

[junos_fw_action_lookup]
filename = juniper_junos_fw_actions.csv

[auto_kv_for_rt_flow_session_create]
## FIELDS: <session created> source-address/source-port->destination-address/destination-port service-name nat-source-address/nat-source-port->nat-destination-address/nat-destination-port src-nat-rule-name dst-nat-rule-name protocol-id policy-name source-zone-name destination-zone-name session-id-32 username(roles) packet-incoming-interface

REGEX = session\s+created\s+(\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+)\s+([\w\-\.]+)\s+(\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+)\s+([\w\-\.]+)\s+([\w\-\.]+)\s+([\w\-\.]+)\s+(\S+)\s+([\w\-\.]+)\s+([\w\-\.]+)\s+([\w\-\.]+)\s+([\w\-\./]+)\(([\w\-\./]+)\)\s+([\w\-\.]+)

FORMAT = src_ip::$1 src_port::$2 dest_ip::$3 dest_port::$4 service::$5 src_translated_ip::$6 src_translated_port::$7 dest_translated_ip::$8 dest_translated_port::$9 src_translated_rule_name::$10 dest_translated_rule_name::$11 protocol_id::$12 policy_name::$13 src_zone::$14 dest_zone::$15 session_id_32::$16 user::$17 user_roles::$18 inbound_interface::$19

[auto_kv_for_rt_flow_session_close]
## FIELDS: <session closed> reason: source-address/source-port->destination-address/destination-port 0xconnection-tag service-name nat-source-address/nat-source-port->nat-destination-address/nat-destination-port 0xnat-connection-tag src-nat-rule-type src-nat-rule-name dst-nat-rule-type dst-nat-rule-name protocol-id policy-name source-zone-name destination-zone-name session-id-32 packets-from-client(bytes-from-client) packets-from-server(bytes-from-server) elapsed-time application nested-application username(roles) packet-incoming-interface encrypted

REGEX = session closed ([^:]+): (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+)\s*([\(\)\w\-\./]+)? ([\(\)\w\-\.]+) (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+)\s*([\(\)\w\-\./]+)?\s*([\(\)\w\-\./]+)? ([\(\)\w\-\./]+)\s*([\(\)\w\-\./]+)? ([\(\)\w\-\./]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\w\-\.]+)\(([\w\-\.]+)\) ([\w\-\.]+)\(([\w\-\.]+)\) ([\w\-\.]+) ([\w\-\.]+) ([\w\-\.]+) ([\w\-\./]+)\(([\w\-\./]+)\) ([\w\-\./]+)\s*([\w\.\-]+)?

FORMAT = reason::$1 src_ip::$2 src_port::$3 dest_ip::$4 dest_port::$5 connection_tag::$6 service::$7 src_translated_ip::$8 src_translated_port::$9 dest_translated_ip::$10 dest_translated_port::$11  translated_connection_tag::$12 src_translated_rule_type::$13 src_translated_rule_name::$14 dest_translated_rule_type::$15 dest_translated_rule_name::$16 protocol_id::$17 policy_name::$18 src_zone::$19 dest_zone::$20 session_id_32::$21 packets_from_client::$22 bytes_from_client::$23 packets_from_server::$24 bytes_from_server::$25 elapsed_time::$26 vendor_app::$27 nested_app::$28 user::$29 user_roles::$30 inbound_interface::$31 encrypted::$32

[auto_kv_for_rt_flow_session_deny]
## FIELDS: session denied source-address/source-port->destination-address/destination-port service-name protocol-id(icmp-type) policy-name source-zone-name destination-zone-name application nested-application username(roles) packet-incoming-interface

REGEX = session denied (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+)\(([\(\)\w\-\.]+)\) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\./]+)\(([\(\)\w\-\./]+)\) ([\(\)\w\-\.]+)\s*([\w\.\-]+)?

FORMAT = src_ip::$1 src_port::$2 dest_ip::$3 dest_port::$4 service::$5 protocol_id::$6 icmp_type::$7 policy_name::$8 src_zone::$9 dest_zone::$10  vendor_app::$11 nested_app::$12 user::$13 user_roles::$14 inbound_interface::$15 encrypted::$16

[auto_kv_for_apptrack_session_close]
## FIELDS: <AppTrack session closed> reason: source-address/source-port->destination-address/destination-port service-name application nested-application nat-source-address/nat-source-port->nat-destination-address/nat-destination-port src-nat-rule-name dst-nat-rule-name protocol-id policy-name source-zone-name destination-zone-name session-id-32 packets-from-client(bytes-from-client) packets-from-server(bytes-from-server) elapsed-time username roles

REGEX = AppTrack session closed ([^:]+): (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+) ([\(\)\w\-\./]+) ([\(\)\w\-\./]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+)\(([\(\)\w\-\.]+)\) ([\(\)\w\-\.]+)\(([\(\)\w\-\.]+)\) ([\(\)\w\-\.]+) ([\(\)\w\-\./]+) ([\(\)\w\-\./]+)\s*([\w\.\-]+)?

FORMAT = reason::$1 src_ip::$2 src_port::$3 dest_ip::$4 dest_port::$5 service::$6 vendor_app::$7 nested_app::$8 src_translated_ip::$9 src_translated_port::$10 dest_translated_ip::$11 dest_translated_port::$12 src_translated_rule_name::$13 dest_translated_rule_name::$14 protocol_id::$15 policy_name::$16 src_zone::$17 dest_zone::$18 session_id_32::$19 packets_from_client::$20 bytes_from_client::$21 packets_from_server::$22 bytes_from_server::$23 elapsed_time::$24 user::$25 user_roles::$26 encrypted::$27


[auto_kv_for_apptrack_session_create]
## FIELDS: <AppTrack session created> source-address/source-port->destination-address/destination-port service-name application nested-application nat-source-address/nat-source-port->nat-destination-address/nat-destination-port src-nat-rule-name dst-nat-rule-name protocol-id policy-name source-zone-name destination-zone-name session-id-32 username roles

REGEX = AppTrack session created (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\./]+) ([\(\)\w\-\./]+)\s*([\w\.\-]+)?

FORMAT = src_ip::$1 src_port::$2 dest_ip::$3 dest_port::$4 service::$5 vendor_app::$6 nested_app::$7 src_translated_ip::$8 src_translated_port::$9 dest_translated_ip::$10 dest_translated_port::$11 src_translated_rule_name::$12 dest_translated_rule_name::$13 protocol_id::$14 policy_name::$15 src_zone::$16 dest_zone::$17 session_id_32::$18 user::$19 user_roles::$20 encrypted::$21


[auto_kv_for_apptrack_session_vol_update]
## FIELDS: <AppTrack volume update>: source-address/source-port->destination-address/destination-port service-name application nested-application nat-source-address/nat-source-port->nat-destination-address/nat-destination-port src-nat-rule-name dst-nat-rule-name protocol-id policy-name source-zone-name destination-zone-name session-id-32 packets-from-client(bytes-from-client) packets-from-server(bytes-from-server) elapsed-time username roles

REGEX = AppTrack volume update: (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) (\d+\.\d+\.\d+\.\d+)/(\d+)->(\d+\.\d+\.\d+\.\d+)/(\d+) ([\(\)\w\-\./]+) ([\(\)\w\-\./]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+) ([\(\)\w\-\.]+)\(([\(\)\w\-\.]+)\) ([\(\)\w\-\.]+)\(([\(\)\w\-\.]+)\) ([\(\)\w\-\.]+) ([\(\)\w\-\./]+) ([\(\)\w\-\./]+)\s*([\w\.\-]+)?

FORMAT = src_ip::$1 src_port::$2 dest_ip::$3 dest_port::$4 service::$5 vendor_app::$6 nested_app::$7 src_translated_ip::$8 src_translated_port::$9 dest_translated_ip::$10 dest_translated_port::$11 src_translated_rule_name::$12 dest_translated_rule_name::$13 protocol_id::$14 policy_name::$15 src_zone::$16 dest_zone::$17 session_id_32::$18 packets_from_client::$19 bytes_from_client::$20 packets_from_server::$21 bytes_from_server::$22 elapsed_time::$23 user::$24 user_roles::$25 encrypted::$26
